Revit 2027 API
CurtainGrid.GetPanelIds Method
 Gets all ElementIds of the panels of the curtain grid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetPanelIds()
Public Function GetPanelIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetPanelIds()
member GetPanelIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
The panel ElementIds
Remarks
 For curtain walls, the ElementIds in this set are of either Panel or Wall Elements. For curtain systems, ElementIds are of Panel Elements.
See Also
Reference
CurtainGrid Class
Autodesk.Revit.DB Namespace